
#include "include.h"
#include "LED.h"

/*------------------------------------------------------------------------------------------------------
【函    数】LED_Init
【功    能】初始化核心板上的LED
【参    数】无
【返 回 值】无
【实    例】LED_Init(); //初始化LED
【注意事项】
--------------------------------------------------------------------------------------------------------*/
void LED_Init(void)
{
    /* 初始化核心板上的LED */
   GPIO_PinInit(PTE28, GPO, 1);//PTE28,推挽输出，高电平
   GPIO_PinInit(PTA4 , GPO, 1);//PTA4,推挽输出，高电平
}

/*------------------------------------------------------------------------------------------------------
【函    数】LED_ON
【功    能】开灯
【参    数】led   :  LED号
【返 回 值】无
【实    例】LED_ON(1); //开LED
【注意事项】
--------------------------------------------------------------------------------------------------------*/
void LED_ON(uint8_t led)
{
    switch(led)
    {

      case 2:
        LED2=0;
        break;

      case 3:
        LED3=0;
        break;


      default:
        break;
    }
}


/*------------------------------------------------------------------------------------------------------
【函    数】LED_OFF
【功    能】关灯
【参    数】led   :  LED号
【返 回 值】无
【实    例】LED_OFF(1); //关LED
【注意事项】
--------------------------------------------------------------------------------------------------------*/
void LED_OFF(uint8_t led)
{

    switch(led)
    {

      case 2:
        LED2=1;
        break;

      case 3:
        LED3=1;
        break;

      default:
        break;
    }
}


/*------------------------------------------------------------------------------------------------------
【函    数】LED_Test
【功    能】测试所有LED
【参    数】无
【返 回 值】无
【实    例】LED_Test(); //测试LED
【注意事项】
--------------------------------------------------------------------------------------------------------*/
void Test_LED(void)
{
    while(1)
    {
        LED2=0;
        LED3=1;
        delayms(300);

        LED2=1;
        LED3=0;
        delayms(300);

        LED2=0;
        LED3=1;
        delayms(300);

        LED2=1;
        LED3=0;
        delayms(300);

        LED2=0;
        LED3=0;
        delayms(300);

        LED2=1;
        LED3=1;
        delayms(300);

        LED2=0;
        LED3=0;
        delayms(300);

        LED2=1;
        LED3=1;
        delayms(300);

    }
}

/**************************************************************************
函数功能：LED闪烁
入口参数：led:灯号，time:闪烁频率
返回  值：无
**************************************************************************/
void Led_Flash(uint8_t led,uint16_t time)
{
  static int temp2,temp3;
  if(led==2)
    {
      temp3=0,LED3=1;
      if(0==time) LED2=0;
      else if(++temp2==time) LED2=~LED2,temp2=0;
    }
else if(led==3)
      {
        temp2=0,LED2=1;
      if(0==time) LED3=0;
      else if(++temp3==time) LED3=~LED3,temp3=0;
      }
}





